Load Pandas library

In [272]:
import pandas as pd
import datetime

Load the csv file

In [273]:
df= pd.read_csv("data4preprocessing.csv")

View first five rows of the data frame

In [275]:
print(df.head())
df.dtypes

           Datetime  AEP_MW
0  2004/12/31 01:00   13478
1  2004/12/31 02:00   12865
2  2004/12/31 03:00   12577
3  2004/12/31 04:00   12517
4  2004/12/31 05:00   12670

Datetime    object
AEP_MW       int64
dtype: object

View the classes of the dataframe columns

In [276]:
df= pd.read_csv("data4preprocessing.csv")
df.head()
df.describe
df.dtypes
timestamp_date_rng= pd.to_datetime(df['Datetime'], infer_datetime_format=True)
df['Datetime']=timestamp_date_rng
df.head()
df.dtypes
df=df.sort_values('Datetime')
df

                 Datetime  AEP_MW
2019  2004-10-01 01:00:00   12379
2020  2004-10-01 02:00:00   11935
2021  2004-10-01 03:00:00   11692
2022  2004-10-01 04:00:00   11597
2023  2004-10-01 05:00:00   11681
...                   ...     ...
89689 2015-12-31 20:00:00   15030
89690 2015-12-31 21:00:00   14642
89691 2015-12-31 22:00:00   14212
89692 2015-12-31 23:00:00   13843
89693 2016-01-01 00:00:00   13487

[97862 rows x 2 columns]

In [277]:
df=df.groupby('Datetime', group_keys=False).mean().reset_index()
df

                 Datetime   AEP_MW
0     2004-10-01 01:00:00  12379.0
1     2004-10-01 02:00:00  11935.0
2     2004-10-01 03:00:00  11692.0
3     2004-10-01 04:00:00  11597.0
4     2004-10-01 05:00:00  11681.0
...                   ...      ...
97855 2015-12-31 20:00:00  15030.0
97856 2015-12-31 21:00:00  14642.0
97857 2015-12-31 22:00:00  14212.0
97858 2015-12-31 23:00:00  13843.0
97859 2016-01-01 00:00:00  13487.0

[97860 rows x 2 columns]

Create a new data frame all date times

In [278]:
df2=pd.date_range(start=df['Datetime'].min(), end=df['Datetime'].max(),freq="H")
val=[0]*len(df2)
val
d={'Datetime':df2,'AEP_MW':val}
final_data=pd.DataFrame(data=d)
final_data

                 Datetime  AEP_MW
0     2004-10-01 01:00:00       0
1     2004-10-01 02:00:00       0
2     2004-10-01 03:00:00       0
3     2004-10-01 04:00:00       0
4     2004-10-01 05:00:00       0
...                   ...     ...
98611 2015-12-31 20:00:00       0
98612 2015-12-31 21:00:00       0
98613 2015-12-31 22:00:00       0
98614 2015-12-31 23:00:00       0
98615 2016-01-01 00:00:00       0

[98616 rows x 2 columns]

Now we need to find entries of datetime in final_data which are there in df

In [279]:
it1=df['Datetime'].isin(final_data['Datetime'])
it2=final_data['Datetime'].isin(df['Datetime'])
len(df['AEP_MW'][it1])
len(final_data['AEP_MW'][it2])
x=final_data
x['AEP_MW'][it2]=(final_data.loc[final_data.index[it2]]['AEP_MW']).values+df['AEP_MW'].values
final_data=x

C:\Users\simrita\Anaconda3\lib\site-packages\ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

Changing the format of a date

In [280]:
final_data

                 Datetime  AEP_MW
0     2004-10-01 01:00:00   12379
1     2004-10-01 02:00:00   11935
2     2004-10-01 03:00:00   11692
3     2004-10-01 04:00:00   11597
4     2004-10-01 05:00:00   11681
...                   ...     ...
98611 2015-12-31 20:00:00   15030
98612 2015-12-31 21:00:00   14642
98613 2015-12-31 22:00:00   14212
98614 2015-12-31 23:00:00   13843
98615 2016-01-01 00:00:00   13487

[98616 rows x 2 columns]

In [281]:

final_data['Datetime']=final_data['Datetime'].dt.strftime('%Y-%m-%d %H:%M:%S')

Changing the format of all the enteries of the Datetime column

In [282]:
final_data

                  Datetime  AEP_MW
0      2004-10-01 01:00:00   12379
1      2004-10-01 02:00:00   11935
2      2004-10-01 03:00:00   11692
3      2004-10-01 04:00:00   11597
4      2004-10-01 05:00:00   11681
...                    ...     ...
98611  2015-12-31 20:00:00   15030
98612  2015-12-31 21:00:00   14642
98613  2015-12-31 22:00:00   14212
98614  2015-12-31 23:00:00   13843
98615  2016-01-01 00:00:00   13487

[98616 rows x 2 columns]

In [283]:
final_data.to_csv("final_data.csv")